app/Controllers/Login.php

    public function authenticate()
    {
        $session = session();
        $model = new UsuarioModel();
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        $user = $model->where('email', $username)->orWhere('dni', $username)->first();// Busca el usuario por email o dni en la base de datos y lo almacena en la variable $user
---
SELECT *
FROM `usuario`
WHERE `email` = 'becerrajohan6@gmail.com'
OR `dni` = 'becerrajohan6@gmail.com'
 LIMIT 1

    public function create()
    {
        $model = new UsuarioModel();
        $data = [
            'nombre' => $this->request->getPost('nombre'),
            'apellido' => $this->request->getPost('apellido'),
            'email' => $this->request->getPost('email'),
            'telefono' => $this->request->getPost('telefono'),
            'dni' => $this->request->getPost('dni'),
            'contraseña' => $this->request->getPost('contraseña'),
            'tipo_usuario' => 'cliente',
        ];
        $model->save($data);
---
INSERT INTO `usuario` (`nombre`, `apellido`, `email`, `telefono`, `dni`, `contraseña`, `tipo_usuario`) VALUES ('johan', 'ventura', 'becerrajohan6@gmail.com', '998113374', '77349472', '$2y$10$W6Gq4AbgJ4/6T9e46y7aguyMSX2erBFftKOkFPi2QtMqJ3fICIGoy', 'cliente')