app/Controllers/Ventas.php

SELECT *
FROM `cliente`
SELECT *
FROM `metodo_pago`
SELECT *
FROM `producto`
SELECT *
FROM `categoria`
---
    public function create()
    {
        // Verificar la sesión de administrador
        $session = session();
        if (!$session->get('isLoggedIn')) {
            return redirect()->to(base_url('admin/login'));
        }

        try {
            $clienteModel = new ClienteModel();
            $metodoPagoModel = new MetodoPagoModel();
            $productoModel = new ProductoModel();
            $categoriaModel = new CategoriaModel();

            $data = [
                'clientes' => $clienteModel->findAll(),
                'metodos_pago' => $metodoPagoModel->findAll(),
                'productos' => $productoModel->findAll(),
                'categorias' => $categoriaModel->findAll()
            ];

SELECT *
FROM `cliente`
WHERE `cliente`.`id_cliente` = 1
---
            $clienteModel = new ClienteModel();
            $metodoPagoModel = new MetodoPagoModel();

            if (!$clienteModel->find($data['id_cliente'])) {

INSERT INTO `venta` (`id_cliente`, `id_usuario`, `metodo_pago_id`, `tipo_comprobante`, `numero_comprobante`, `total`, `estado`, `estado_pago`, `referencia_pago`) VALUES (1, 1, 2, 'boleta', 'B-00000002', 2.4, 'completada', 'pagado', 'EFECTIVO-2.4')
---
            }

            // Insertar venta
            $id_venta = $ventaModel->insert($data);

INSERT INTO `detalle_venta` (`id_venta`, `id_producto`, `cantidad`, `precio_unitario`, `subtotal`) VALUES (2, 2, 2, 1.2, 2.4)
---
                        'subtotal' => $detalle['subtotal']
                    ];

                    if (!$detalleVentaModel->insert($detalleData)) {

SELECT *
FROM `producto`
WHERE `producto`.`id_producto` = 2
---
                    }

                    // Actualizar stock
                    $producto = $productoModel->find($detalle['id_producto']);

UPDATE `producto` SET `stock` = 98
WHERE `producto`.`id_producto` IN (2)
---
                        throw new \Exception('Producto no encontrado: ' . $detalle['id_producto']);
                    }

                    if (!$productoModel->update($detalle['id_producto'], [
                        'stock' => $producto['stock'] - $detalle['cantidad']
                    ])) {

SELECT `numero_comprobante`
FROM `venta`
WHERE `tipo_comprobante` = 'boleta'
ORDER BY `id_venta` DESC
 LIMIT 1
SELECT `numero_comprobante`
FROM `venta`
WHERE `tipo_comprobante` = 'factura'
ORDER BY `id_venta` DESC
 LIMIT 1
---
    public function getLastComprobanteNumbers()
    {
        try {
            $ventaModel = new VentaModel();

            // Obtener último número de boleta
            $lastBoleta = $ventaModel->select('numero_comprobante')
                ->where('tipo_comprobante', 'boleta')
                ->orderBy('id_venta', 'DESC')
                ->limit(1)
                ->get()
                ->getRowArray();

            // Obtener último número de factura
            $lastFactura = $ventaModel->select('numero_comprobante')
                ->where('tipo_comprobante', 'factura')
                ->orderBy('id_venta', 'DESC')
                ->limit(1)
                ->get()
                ->getRowArray();